arch/regression_results/FM_ARC_DigitalHub_with_SB89/OpenFOAM/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/* Butterfly 0.0.5                https://github.com/ladybug-tools/butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		4.0;
	format		ascii;
	class		dictionary;
	location	"system";
	object		blockMeshDict;
}

convertToMeters 1.0000;

vertices
(
	(62.96379509493304 7.025018813128688 3.799999516666655)
	(69.97504549493304 7.025018813128688 3.799999516666655)
	(69.97504549493304 12.72751949646203 3.799999516666655)
	(62.96379509493304 12.72751949646203 3.799999516666655)
	(62.96379509493304 7.025018813128688 7.500000200000001)
	(69.97504549493304 7.025018813128688 7.500000200000001)
	(69.97504549493304 12.72751949646203 7.500000200000001)
	(62.96379509493304 12.72751949646203 7.500000200000001)
);

blocks
(
hex (0 1 2 3 4 5 6 7) (70 57 37) 
simpleGrading (
	1.0
	1.0
	1.0
	)
);

edges
(
);

boundary
(   boundingbox
   {
       type wall;
       faces
       (       
	(0 3 2 1)
	(4 5 6 7)
	(1 2 6 5)
	(3 0 4 7)
	(0 1 5 4)
	(2 3 7 6)
       );
   }
);

mergePatchPair
(
);
