arch/regression_results/FM_ARC_DigitalHub_with_SB89/OpenFOAM/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/* Butterfly 0.0.5                https://github.com/ladybug-tools/butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		4.0;
	format		ascii;
	class		dictionary;
	location	"system";
	object		snappyHexMeshDict;
}

castellatedMesh		true;

snap		true;

addLayers		false;

geometry
{

    space_3hiy47ppf5B8MyZqbpTfpc.stl
    {

        type		triSurfaceMesh;

        name		space_3hiy47ppf5B8MyZqbpTfpc;

        regions
        {

            InnerFloor_3YmTTmFtbDPRDphiCy399_
            {

                name		InnerFloor_3YmTTmFtbDPRDphiCy399_;

            }

            InnerFloor_14KVjb4bn2zOxEfCwOWKb_
            {

                name		InnerFloor_14KVjb4bn2zOxEfCwOWKb_;

            }

            InnerWall_0EYBE3lWP5OQPgfymh45fT
            {

                name		InnerWall_0EYBE3lWP5OQPgfymh45fT;

            }

            InnerWall_10NUX___CcjBcRRxCQJh2Suf
            {

                name		InnerWall_10NUX___CcjBcRRxCQJh2Suf;

            }

            Roof_174xOdW7H4iw488r9lVn33
            {

                name		Roof_174xOdW7H4iw488r9lVn33;

            }

            InnerDoor_0aGOY_OOT9fva8zh0hPM___t
            {

                name		InnerDoor_0aGOY_OOT9fva8zh0hPM___t;

            }

            InnerWall_1r3PHt9bbCOPWBJytLgNNf
            {

                name		InnerWall_1r3PHt9bbCOPWBJytLgNNf;

            }

            InnerWall_0poZkiU6nAzQsz___5j1tEEO
            {

                name		InnerWall_0poZkiU6nAzQsz___5j1tEEO;

            }

            InnerWall_18dtnPzhbDfA93nuFIFIQD
            {

                name		InnerWall_18dtnPzhbDfA93nuFIFIQD;

            }

            OuterWall_3eJjh1rC9D6u9xQvTJvVV1
            {

                name		OuterWall_3eJjh1rC9D6u9xQvTJvVV1;

            }

            OuterWall_1Rq56ElXP9mOLKW7Xhapuj
            {

                name		OuterWall_1Rq56ElXP9mOLKW7Xhapuj;

            }

            Window_3YwbLt4uL17hwYjrGkpnG2
            {

                name		Window_3YwbLt4uL17hwYjrGkpnG2;

            }

            OuterWall_1T2XvptoT41wqhpFAnaD97
            {

                name		OuterWall_1T2XvptoT41wqhpFAnaD97;

            }

            OuterWall_0An_qycgfB5RACnBVc2erc
            {

                name		OuterWall_0An_qycgfB5RACnBVc2erc;

            }

            Window_3tw6evsPf4cOKvenfxmdSF
            {

                name		Window_3tw6evsPf4cOKvenfxmdSF;

            }

        }

    }

    heater0_surface.stl
    {

        type		triSurfaceMesh;

        name		heater0_surface;

        regions
        {

            heater0_surface
            {

                name		heater0_surface;

            }

        }

    }

    heater0_porous_media
    {

        type		searchableBox;

        min		(69.76595450859561 8.217533928819867 3.9199998010609516);

        max		(69.82595490723664 9.307534326054233 4.600000205340594);

    }

    heater1_surface.stl
    {

        type		triSurfaceMesh;

        name		heater1_surface;

        regions
        {

            heater1_surface
            {

                name		heater1_surface;

            }

        }

    }

    heater1_porous_media
    {

        type		searchableBox;

        min		(65.50995454111589 7.184340290674085 3.919999801060953);

        max		(67.399954905067 7.244340693857002 4.600000205340595);

    }

    inlet_0_diffuser.stl
    {

        type		triSurfaceMesh;

        name		inlet_0_diffuser;

        regions
        {

            inlet_0_diffuser
            {

                name		inlet_0_diffuser;

            }

        }

    }

    inlet_0_source_sink.stl
    {

        type		triSurfaceMesh;

        name		inlet_0_source_sink;

        regions
        {

            inlet_0_source_sink
            {

                name		inlet_0_source_sink;

            }

        }

    }

    inlet_0_box.stl
    {

        type		triSurfaceMesh;

        name		inlet_0_box;

        regions
        {

            inlet_0_box
            {

                name		inlet_0_box;

            }

        }

    }

    inlet_0_refinement_small
    {

        type		searchableBox;

        min		(65.79995430506702 9.678023467657846 6.7999999);

        max		(67.199955105067 9.996024267657846 7.21657505172875);

    }

    inlet_0_refinement_large
    {

        type		searchableBox;

        min		(65.69995430506701 9.578023467657847 6.6999999);

        max		(67.29995510506701 10.096024267657846 7.3165750517287504);

    }

    outlet_overflow_0_source_sink.stl
    {

        type		triSurfaceMesh;

        name		outlet_overflow_0_source_sink;

        regions
        {

            outlet_overflow_0_source_sink
            {

                name		outlet_overflow_0_source_sink;

            }

        }

    }

    outlet_overflow_0_refinement_small
    {

        type		searchableBox;

        min		(63.0637950115997 12.527518729795345 3.7999997166666546);

        max		(64.3537955782664 12.727519296462033 4.020000083333331);

    }

    outlet_overflow_0_refinement_large
    {

        type		searchableBox;

        min		(62.9637950115997 12.427518729795345 3.6999997166666545);

        max		(64.45379557826641 12.827519296462032 4.1200000833333315);

    }

    furniture_Tab0_Chair0.stl
    {

        type		triSurfaceMesh;

        name		furniture_Tab0_Chair0;

        regions
        {

            furniture_Tab0_Chair0
            {

                name		furniture_Tab0_Chair0;

            }

        }

    }

    furniture_Desk0.stl
    {

        type		triSurfaceMesh;

        name		furniture_Desk0;

        regions
        {

            furniture_Desk0
            {

                name		furniture_Desk0;

            }

        }

    }

    furniture_Tab1_Chair0.stl
    {

        type		triSurfaceMesh;

        name		furniture_Tab1_Chair0;

        regions
        {

            furniture_Tab1_Chair0
            {

                name		furniture_Tab1_Chair0;

            }

        }

    }

    furniture_Desk1.stl
    {

        type		triSurfaceMesh;

        name		furniture_Desk1;

        regions
        {

            furniture_Desk1
            {

                name		furniture_Desk1;

            }

        }

    }

    furniture_Tab2_Chair0.stl
    {

        type		triSurfaceMesh;

        name		furniture_Tab2_Chair0;

        regions
        {

            furniture_Tab2_Chair0
            {

                name		furniture_Tab2_Chair0;

            }

        }

    }

    furniture_Desk2.stl
    {

        type		triSurfaceMesh;

        name		furniture_Desk2;

        regions
        {

            furniture_Desk2
            {

                name		furniture_Desk2;

            }

        }

    }

    furniture_Tab3_Chair0.stl
    {

        type		triSurfaceMesh;

        name		furniture_Tab3_Chair0;

        regions
        {

            furniture_Tab3_Chair0
            {

                name		furniture_Tab3_Chair0;

            }

        }

    }

    furniture_Desk3.stl
    {

        type		triSurfaceMesh;

        name		furniture_Desk3;

        regions
        {

            furniture_Desk3
            {

                name		furniture_Desk3;

            }

        }

    }

    person_Person0_FullBody.stl
    {

        type		triSurfaceMesh;

        name		person_Person0_FullBody;

        regions
        {

            person_Person0_FullBody
            {

                name		person_Person0_FullBody;

            }

        }

    }

    person_Person1_FullBody.stl
    {

        type		triSurfaceMesh;

        name		person_Person1_FullBody;

        regions
        {

            person_Person1_FullBody
            {

                name		person_Person1_FullBody;

            }

        }

    }

    person_Person2_FullBody.stl
    {

        type		triSurfaceMesh;

        name		person_Person2_FullBody;

        regions
        {

            person_Person2_FullBody
            {

                name		person_Person2_FullBody;

            }

        }

    }

    person_Person3_FullBody.stl
    {

        type		triSurfaceMesh;

        name		person_Person3_FullBody;

        regions
        {

            person_Person3_FullBody
            {

                name		person_Person3_FullBody;

            }

        }

    }

}

castellatedMeshControls
{

    maxLocalCells		1000000;

    maxGlobalCells		3000000;

    minRefinementCells		5;

    maxLoadUnbalance		0.10;

    nCellsBetweenLevels		3;

    features		();

    refinementSurfaces
    {

        space_3hiy47ppf5B8MyZqbpTfpc
        {

            level		(1 2);

            regions
            {

                InnerFloor_3YmTTmFtbDPRDphiCy399_
                {

                    level		(2 3);

                    patchInfo
                    {

                        type		wall;

                    }

                }

                InnerFloor_14KVjb4bn2zOxEfCwOWKb_
                {

                    level		(2 3);

                    patchInfo
                    {

                        type		wall;

                    }

                }

                InnerWall_0EYBE3lWP5OQPgfymh45fT
                {

                    level		(2 3);

                    patchInfo
                    {

                        type		wall;

                    }

                }

                InnerWall_10NUX___CcjBcRRxCQJh2Suf
                {

                    level		(2 3);

                    patchInfo
                    {

                        type		wall;

                    }

                }

                Roof_174xOdW7H4iw488r9lVn33
                {

                    level		(2 3);

                    patchInfo
                    {

                        type		wall;

                    }

                }

                InnerDoor_0aGOY_OOT9fva8zh0hPM___t
                {

                    level		(2 3);

                    patchInfo
                    {

                        type		wall;

                    }

                }

                InnerWall_1r3PHt9bbCOPWBJytLgNNf
                {

                    level		(2 3);

                    patchInfo
                    {

                        type		wall;

                    }

                }

                InnerWall_0poZkiU6nAzQsz___5j1tEEO
                {

                    level		(2 3);

                    patchInfo
                    {

                        type		wall;

                    }

                }

                InnerWall_18dtnPzhbDfA93nuFIFIQD
                {

                    level		(2 3);

                    patchInfo
                    {

                        type		wall;

                    }

                }

                OuterWall_3eJjh1rC9D6u9xQvTJvVV1
                {

                    level		(2 3);

                    patchInfo
                    {

                        type		wall;

                    }

                }

                OuterWall_1Rq56ElXP9mOLKW7Xhapuj
                {

                    level		(2 3);

                    patchInfo
                    {

                        type		wall;

                    }

                }

                Window_3YwbLt4uL17hwYjrGkpnG2
                {

                    level		(2 3);

                    patchInfo
                    {

                        type		wall;

                    }

                }

                OuterWall_1T2XvptoT41wqhpFAnaD97
                {

                    level		(2 3);

                    patchInfo
                    {

                        type		wall;

                    }

                }

                OuterWall_0An_qycgfB5RACnBVc2erc
                {

                    level		(2 3);

                    patchInfo
                    {

                        type		wall;

                    }

                }

                Window_3tw6evsPf4cOKvenfxmdSF
                {

                    level		(2 3);

                    patchInfo
                    {

                        type		wall;

                    }

                }

            }

        }

        heater0_surface
        {

            level		(1 2);

            regions
            {

                heater0_surface
                {

                    level		(2 3);

                    patchInfo
                    {

                        type		wall;

                    }

                }

            }

        }

        heater1_surface
        {

            level		(1 2);

            regions
            {

                heater1_surface
                {

                    level		(2 3);

                    patchInfo
                    {

                        type		wall;

                    }

                }

            }

        }

        inlet_0_diffuser
        {

            level		(2 5);

            regions
            {

                inlet_0_diffuser
                {

                    level		(2 5);

                    patchInfo
                    {

                        type		wall;

                    }

                }

            }

        }

        inlet_0_source_sink
        {

            level		(1 2);

            regions
            {

                inlet_0_source_sink
                {

                    level		(2 5);

                    patchInfo
                    {

                        type		inlet_0;

                    }

                }

            }

        }

        inlet_0_box
        {

            level		(1 2);

            regions
            {

                inlet_0_box
                {

                    level		(1 3);

                    patchInfo
                    {

                        type		wall;

                    }

                }

            }

        }

        outlet_overflow_0_source_sink
        {

            level		(1 2);

            regions
            {

                outlet_overflow_0_source_sink
                {

                    level		(2 5);

                    patchInfo
                    {

                        type		outlet_overflow_0;

                    }

                }

            }

        }

        null
        {

            level		(1 2);

            regions
            {

                null
                {

                    level		(1 3);

                    patchInfo
                    {

                        type		wall;

                    }

                }

            }

        }

        furniture_Tab0_Chair0
        {

            level		(1 2);

            regions
            {

                furniture_Tab0_Chair0
                {

                    level		(2 3);

                    patchInfo
                    {

                        type		wall;

                    }

                }

            }

        }

        furniture_Desk0
        {

            level		(1 2);

            regions
            {

                furniture_Desk0
                {

                    level		(2 3);

                    patchInfo
                    {

                        type		wall;

                    }

                }

            }

        }

        furniture_Tab1_Chair0
        {

            level		(1 2);

            regions
            {

                furniture_Tab1_Chair0
                {

                    level		(2 3);

                    patchInfo
                    {

                        type		wall;

                    }

                }

            }

        }

        furniture_Desk1
        {

            level		(1 2);

            regions
            {

                furniture_Desk1
                {

                    level		(2 3);

                    patchInfo
                    {

                        type		wall;

                    }

                }

            }

        }

        furniture_Tab2_Chair0
        {

            level		(1 2);

            regions
            {

                furniture_Tab2_Chair0
                {

                    level		(2 3);

                    patchInfo
                    {

                        type		wall;

                    }

                }

            }

        }

        furniture_Desk2
        {

            level		(1 2);

            regions
            {

                furniture_Desk2
                {

                    level		(2 3);

                    patchInfo
                    {

                        type		wall;

                    }

                }

            }

        }

        furniture_Tab3_Chair0
        {

            level		(1 2);

            regions
            {

                furniture_Tab3_Chair0
                {

                    level		(2 3);

                    patchInfo
                    {

                        type		wall;

                    }

                }

            }

        }

        furniture_Desk3
        {

            level		(1 2);

            regions
            {

                furniture_Desk3
                {

                    level		(2 3);

                    patchInfo
                    {

                        type		wall;

                    }

                }

            }

        }

        person_Person0_FullBody
        {

            level		(1 2);

            regions
            {

                person_Person0_FullBody
                {

                    level		(4 4);

                    patchInfo
                    {

                        type		wall;

                    }

                }

            }

        }

        person_Person1_FullBody
        {

            level		(1 2);

            regions
            {

                person_Person1_FullBody
                {

                    level		(4 4);

                    patchInfo
                    {

                        type		wall;

                    }

                }

            }

        }

        person_Person2_FullBody
        {

            level		(1 2);

            regions
            {

                person_Person2_FullBody
                {

                    level		(4 4);

                    patchInfo
                    {

                        type		wall;

                    }

                }

            }

        }

        person_Person3_FullBody
        {

            level		(1 2);

            regions
            {

                person_Person3_FullBody
                {

                    level		(4 4);

                    patchInfo
                    {

                        type		wall;

                    }

                }

            }

        }

    }

    resolveFeatureAngle		60;

    refinementRegions
    {

        heater0_porous_media
        {

            mode		inside;

            levels		((0 3));

        }

        heater0_surface
        {

            mode		distance;

            levels		((0.05 3) (0.15 2));

        }

        heater1_porous_media
        {

            mode		inside;

            levels		((0 3));

        }

        heater1_surface
        {

            mode		distance;

            levels		((0.05 3) (0.15 2));

        }

        inlet_0_source_sink
        {

            mode		distance;

            levels		((0.03 5) (0.08 4));

        }

        inlet_0_diffuser
        {

            mode		distance;

            levels		((0.03 5) (0.08 4));

        }

        outlet_overflow_0_source_sink
        {

            mode		distance;

            levels		((0.03 5) (0.08 4));

        }

        null
        {

            mode		distance;

            levels		((0.03 5) (0.08 4));

        }

        furniture_Tab0_Chair0
        {

            mode		distance;

            levels		((0.03 3)(0.06 2));

        }

        furniture_Desk0
        {

            mode		distance;

            levels		((0.03 3)(0.06 2));

        }

        furniture_Tab1_Chair0
        {

            mode		distance;

            levels		((0.03 3)(0.06 2));

        }

        furniture_Desk1
        {

            mode		distance;

            levels		((0.03 3)(0.06 2));

        }

        furniture_Tab2_Chair0
        {

            mode		distance;

            levels		((0.03 3)(0.06 2));

        }

        furniture_Desk2
        {

            mode		distance;

            levels		((0.03 3)(0.06 2));

        }

        furniture_Tab3_Chair0
        {

            mode		distance;

            levels		((0.03 3)(0.06 2));

        }

        furniture_Desk3
        {

            mode		distance;

            levels		((0.03 3)(0.06 2));

        }

        person_Person0_FullBody
        {

            mode		distance;

            levels		((0.05 4)(0.1 3));

        }

        person_Person1_FullBody
        {

            mode		distance;

            levels		((0.05 4)(0.1 3));

        }

        person_Person2_FullBody
        {

            mode		distance;

            levels		((0.05 4)(0.1 3));

        }

        person_Person3_FullBody
        {

            mode		distance;

            levels		((0.05 4)(0.1 3));

        }

    }

    locationInMesh		(66.46942029493304 9.876269013128688 5.65);

    allowFreeStandingZoneFaces		true;

    gapMode		mixed;

    gapLevel		(3 0 7);

}

snapControls
{

    nSmoothPatch		5;

    tolerance		5.0;

    nSolveIter		50;

    nRelaxIter		15;

    nFeatureSnapIter		10;

    explicitFeatureSnap		false;

    implicitFeatureSnap		true;

    multiRegionFeatureSnap		false;

}

addLayersControls
{

    relativeSizes		true;

    layers{}

    expansionRatio		1.0;

    finalLayerThickness		0.3;

    minThickness		0.2;

    nGrow		0;

    featureAngle		110;

    nRelaxIter		3;

    nSmoothSurfaceNormals		1;

    nSmoothThickness		10;

    nSmoothNormals		3;

    maxFaceThicknessRatio		0.5;

    maxThicknessToMedialRatio		0.3;

    minMedianAxisAngle		130;

    nBufferCellsNoExtrude		0;

    nLayerIter		50;

    nRelaxedIter		20;

}

meshQualityControls
{

    maxNonOrtho		60;

    maxBoundarySkewness		20;

    maxInternalSkewness		3;

    maxConcave		80;

    minFlatness		0.5;

    minVol		1e-13;

    minTetQuality		1e-15;

    minArea		-1;

    minTwist		0.02;

    minDeterminant		0.001;

    minFaceWeight		0.02;

    minVolRatio		0.01;

    minTriangleTwist		-1;

    nSmoothScale		4;

    errorReduction		0.75;

    relaxed
    {

        maxNonOrtho		75;

    }

}

debug		0;

mergeTolerance		1E-6;