arch/regression_results/FM_ARC_DigitalHub_with_SB89/OpenFOAM/constant/boundaryRadiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/* Butterfly 0.0.5                https://github.com/ladybug-tools/butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		4.0;
	format		ascii;
	class		dictionary;
	location	"constant";
	object		boundaryRadiationProperties;
}

dimensions		[0 0 0 0 0 0 0];

internalField		uniform 0;

InnerFloor_3YmTTmFtbDPRDphiCy399_
{

    type		lookup;

    emissivity		0.90;

    absorptivity		0.90;

    transmissivity		0;

}

InnerFloor_14KVjb4bn2zOxEfCwOWKb_
{

    type		lookup;

    emissivity		0.90;

    absorptivity		0.90;

    transmissivity		0;

}

InnerWall_0EYBE3lWP5OQPgfymh45fT
{

    type		lookup;

    emissivity		0.90;

    absorptivity		0.90;

    transmissivity		0;

}

InnerWall_10NUX___CcjBcRRxCQJh2Suf
{

    type		lookup;

    emissivity		0.90;

    absorptivity		0.90;

    transmissivity		0;

}

Roof_174xOdW7H4iw488r9lVn33
{

    type		lookup;

    emissivity		0.90;

    absorptivity		0.90;

    transmissivity		0;

}

InnerDoor_0aGOY_OOT9fva8zh0hPM___t
{

    type		lookup;

    emissivity		0.90;

    absorptivity		0.90;

    transmissivity		0;

}

InnerWall_1r3PHt9bbCOPWBJytLgNNf
{

    type		lookup;

    emissivity		0.90;

    absorptivity		0.90;

    transmissivity		0;

}

InnerWall_0poZkiU6nAzQsz___5j1tEEO
{

    type		lookup;

    emissivity		0.90;

    absorptivity		0.90;

    transmissivity		0;

}

InnerWall_18dtnPzhbDfA93nuFIFIQD
{

    type		lookup;

    emissivity		0.90;

    absorptivity		0.90;

    transmissivity		0;

}

OuterWall_3eJjh1rC9D6u9xQvTJvVV1
{

    type		lookup;

    emissivity		0.90;

    absorptivity		0.90;

    transmissivity		0;

}

OuterWall_1Rq56ElXP9mOLKW7Xhapuj
{

    type		lookup;

    emissivity		0.90;

    absorptivity		0.90;

    transmissivity		0;

}

Window_3YwbLt4uL17hwYjrGkpnG2
{

    type		lookup;

    emissivity		0.90;

    absorptivity		0.90;

    transmissivity		0;

}

OuterWall_1T2XvptoT41wqhpFAnaD97
{

    type		lookup;

    emissivity		0.90;

    absorptivity		0.90;

    transmissivity		0;

}

OuterWall_0An_qycgfB5RACnBVc2erc
{

    type		lookup;

    emissivity		0.90;

    absorptivity		0.90;

    transmissivity		0;

}

Window_3tw6evsPf4cOKvenfxmdSF
{

    type		lookup;

    emissivity		0.90;

    absorptivity		0.90;

    transmissivity		0;

}

heater0_surface
{

    type		lookup;

    emissivity		0.90;

    absorptivity		0.90;

    transmissivity		0;

}

heater1_surface
{

    type		lookup;

    emissivity		0.90;

    absorptivity		0.90;

    transmissivity		0;

}

inlet_0_diffuser
{

    type		lookup;

    emissivity		0.90;

    absorptivity		0.90;

    transmissivity		0;

}

inlet_0_source_sink
{

    type		lookup;

    emissivity		0.90;

    absorptivity		0.90;

    transmissivity		0;

}

inlet_0_box
{

    type		lookup;

    emissivity		0.90;

    absorptivity		0.90;

    transmissivity		0;

}

outlet_overflow_0_source_sink
{

    type		lookup;

    emissivity		0.90;

    absorptivity		0.90;

    transmissivity		0;

}

furniture_Tab0_Chair0
{

    type		lookup;

    emissivity		0.90;

    absorptivity		0.90;

    transmissivity		0;

}

furniture_Desk0
{

    type		lookup;

    emissivity		0.90;

    absorptivity		0.90;

    transmissivity		0;

}

furniture_Tab1_Chair0
{

    type		lookup;

    emissivity		0.90;

    absorptivity		0.90;

    transmissivity		0;

}

furniture_Desk1
{

    type		lookup;

    emissivity		0.90;

    absorptivity		0.90;

    transmissivity		0;

}

furniture_Tab2_Chair0
{

    type		lookup;

    emissivity		0.90;

    absorptivity		0.90;

    transmissivity		0;

}

furniture_Desk2
{

    type		lookup;

    emissivity		0.90;

    absorptivity		0.90;

    transmissivity		0;

}

furniture_Tab3_Chair0
{

    type		lookup;

    emissivity		0.90;

    absorptivity		0.90;

    transmissivity		0;

}

furniture_Desk3
{

    type		lookup;

    emissivity		0.90;

    absorptivity		0.90;

    transmissivity		0;

}

person_Person0_FullBody
{

    type		lookup;

    emissivity		0.90;

    absorptivity		0.90;

    transmissivity		0;

}

person_Person1_FullBody
{

    type		lookup;

    emissivity		0.90;

    absorptivity		0.90;

    transmissivity		0;

}

person_Person2_FullBody
{

    type		lookup;

    emissivity		0.90;

    absorptivity		0.90;

    transmissivity		0;

}

person_Person3_FullBody
{

    type		lookup;

    emissivity		0.90;

    absorptivity		0.90;

    transmissivity		0;

}

boundingbox
{

    type		lookup;

    emissivity		0.90;

    absorptivity		0.90;

    transmissivity		0;

}