arch/regression_results/FM_ARC_DigitalHub_with_SB89/OpenFOAM/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/* Butterfly 0.0.5                https://github.com/ladybug-tools/butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		4.0;
	format		ascii;
	class		dictionary;
	location	"system";
	object		fvSchemes;
}

ddtSchemes
{

    default		steadyState;

}

gradSchemes
{

    default		Gauss linear;

    grad(AoA)		cellLimited Gauss linear 1;

}

divSchemes
{

    default		none;

    div(phi,U)		bounded Gauss upwind;

    div(phi,epsilon)		bounded Gauss linearUpwind grad(epsilon);

    div(phi,k)		bounded Gauss upwind;

    div((nuEff*dev2(T(grad(U)))))		Gauss linear;

    div(phi,h)		bounded Gauss upwind;

    div(phi,e)		bounded Gauss upwind;

    div(phi,K)		bounded Gauss upwind;

    div(((rho*nuEff)*dev2(T(grad(U)))))		Gauss linear;

    div(phi,omega)		bounded Gauss upwind;

    div(Ji,Ii_h)		bounded Gauss linearUpwind grad(Ii_h);

    div(phi,AoA)		bounded Gauss linearUpwind grad(AoA);

}

laplacianSchemes
{

    default		Gauss linear corrected;

}

interpolationSchemes
{

    default		linear;

}

snGradSchemes
{

    default		corrected;

}

fluxRequired
{

    default		no;

}

wallDist
{

    method		meshWave;

}